# CLI tools
brew "starship"       # Terminal prompt customization
brew "kubectl"        # Kubernetes CLI
brew "direnv"         # Per-directory environment variables (.envrc)
brew "zsh"            # Homebrew-managed ZSH (replaces macOS system zsh)
brew "git"            # Version control
brew "gh"             # GitHub CLI
brew "awscli"         # AWS CLI
brew "jq"             # JSON processor
brew "yq"             # YAML processor
brew "htop"           # Interactive process viewer
brew "wget"           # HTTP file retrieval
brew "curl"           # HTTP client
brew "tree"           # Directory tree listing
brew "zoxide"         # Smarter cd / z replacement
brew "fd"             # Fast find replacement
brew "pyenv"          # Python version manager
brew "fnm"            # Fast Node version manager
brew "bat"            # Syntax-highlighted cat replacement
brew "ripgrep"        # Fast grep replacement (rg)
brew "eza"            # Modern ls replacement

# Fonts
cask "font-fira-code-nerd-font"  # Nerd Font for terminal/editor icons

# Applications
cask "warp"                # Terminal
cask "visual-studio-code"  # IDE
cask "arc"                 # Browser
cask "1password"           # Password manager
cask "rectangle"           # Window management (successor to Spectacle)
cask "jordanbaird-ice"     # Menu bar icon management
cask "claude"              # Claude desktop
cask "rancher"             # Rancher Desktop (container runtime + k8s)
cask "alfred"              # Spotlight replacement
cask "dropbox"             # Cloud storage & file sync
